# vim: ft=conf
# $ cut -d# -f1 pkglist.txt | sudo pacman -S --needed -
# Remember to review and (un)comment out as necessary before install!

base
linux
linux-firmware
posix-user-portability
sudo

# Either:
#   amd-ucode
#   intel-ucode

# Uncomment if Nvidia GPU:
#   nvidia
#   nvidia-settings

bash
bash-completion
dash
expect
fzf
git
htop
openssh
pass
rsync
tmux
vim

man-db
man-pages

p7zip
unrar
unzip
zip

aerc
curlftpfs
imagemagick
ranger
sshfs
testdisk
transmission-cli
udisks2
urlscan
w3m

autopep8
ccache
cmake
cscope
ctags
deno
doxygen
gdb
graphviz
jedi-language-server
jq
jre-openjdk
multilib-devel
nasm
openscad
python
radare2
shellcheck
strace
tectonic
texlab
tidy
uncrustify
valgrind

podman
wine

xclip
xdotool
xorg-server
xorg-xinit
xorg-xrandr
xterm

dmenu
dunst
elementary-icon-theme
gtk-engine-murrine
i3-wm
i3blocks
qt5ct
scrot
stalonetray

ttf-dejavu
wqy-zenhei

alsa-utils
pavucontrol
pipewire-pulse

dosbox
feh
firefox
libreoffice-still
mpv
simple-scan
steam
yt-dlp
zathura
zathura-pdf-mupdf

audacity
gimp
inkscape
shotcut

bluez
bluez-utils
ethtool

libvirt
qemu-desktop
virt-install
virt-viewer

# ifuse                     # fuse fs to access contents of an iPhone/iPad
# gphoto2                   # digital camera download and access program
# android-file-transfer
# heimdall                  # tool suite used to flash ROMs onto Galaxy devices
# scrcpy                    # display and control Android device
# xf86-input-wacom


# AUR --------------------------------------------------------------------------

# yay-bin

# ccls-git
# compiledb
# cura-bin
# imapfilter
# openscad-lsp-git
# qt5gtk2
# saleae-logic2
# simplescreenrecorder
