# vim: cms=#\ %s
# $ cut -d# -f1 pkglist.txt | sudo pacman -S --needed -
# Remember to review and (un)comment out as necessary before install!

base
linux
linux-firmware
sudo

posix
posix-c-development
posix-software-development
posix-user-portability
posix-xsi

# Either:
#   amd-ucode
#   intel-ucode

# Uncomment if Nvidia GPU:
#   nvidia
#   nvidia-settings

bash
bash-completion
dash
expect
fzf
htop
openssh
pass
rsync
tmux
vim
xterm

git
# git-lfs
# git-annex

man-db
man-pages

p7zip
unrar
unzip
zip

aerc
isync
msmtp

curlftpfs
gvfs
imagemagick
python-pipx
ranger
squashfs-tools
sshfs
termshark
testdisk
tigervnc
transmission-cli
udisks2
visidata
w3m
yad

ccache
cmake
doxygen
graphviz
jq
jre-openjdk
multilib-devel
nasm
openscad
python
tectonic

gdb
strace
radare2

cscope
ctags

tidy
autopep8
uncrustify

vint
vale
valgrind
shellcheck

ccls
deno
jedi-language-server
sqls
texlab
vim-language-server

fuse-overlayfs
podman
podman-docker
wine

i3-wm
polybar
scrot
xclip
xdotool
xorg-server
xorg-xinit
xorg-xrandr

# sway
# waybar
# grim
# nwg-displays
# slurp
# ydotool

dmenu
dunst

qt5ct

ttf-dejavu
wqy-zenhei

alsa-utils
pulsemixer
pipewire-pulse

feh
firefox
libreoffice-still
mpv
xsane
yt-dlp
zathura
zathura-pdf-mupdf

# gimp
# inkscape
# obs-studio
# shotcut
# tenacity

# bluez
# bluez-utils
# ethtool

libvirt
qemu-desktop
virt-install
virt-viewer

# ifuse                     # fuse fs to access contents of an iPhone/iPad
# gphoto2                   # digital camera download and access program
# android-file-transfer
# heimdall                  # tool suite used to flash ROMs onto Galaxy devices
# scrcpy                    # display and control Android device
# xf86-input-wacom


# AUR --------------------------------------------------------------------------

# yay-bin

# compiledb
# cura-bin
# cyrus-sasl-xoauth2-git
# imapfilter
# openscad-lsp-git
# rr-bin
# saleae-logic2
# tor-browser-bin
